Terraform plan in __terraform/awsk3s01__
<details>
<summary>Plan: 11 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_iam_role.role will be created
  + resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "ec2.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "awsk3s01"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "repo" = "yardbirdsax/infra-k8slab"
        }
      + tags_all              = {
          + "repo" = "yardbirdsax/infra-k8slab"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.ssm will be created
  + resource "aws_iam_role_policy_attachment" "ssm" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "awsk3s01"
    }

  # aws_security_group.cluster will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "awsk3s01"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "awsk3s01"
          + "repo" = "yardbirdsax/infra-k8slab"
        }
      + tags_all               = {
          + "Name" = "awsk3s01"
          + "repo" = "yardbirdsax/infra-k8slab"
        }
      + vpc_id                 = "*********************"
    }

  # aws_security_group.minecraft_bedrock will be created
  + resource "aws_security_group" "minecraft_bedrock" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "minecraft"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "minecraft"
          + "repo" = "yardbirdsax/infra-k8slab"
        }
      + tags_all               = {
          + "Name" = "minecraft"
          + "repo" = "yardbirdsax/infra-k8slab"
        }
      + vpc_id                 = "*********************"
    }

  # aws_security_group_rule.egress will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "egress"
    }

  # aws_security_group_rule.minecraft_bedrock will be created
  + resource "aws_security_group_rule" "minecraft_bedrock" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 19132
      + id                       = (known after apply)
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 19132
      + type                     = "ingress"
    }

  # module.k3s.data.cloudinit_config.agent_user_data will be read during apply
  # (config refers to values not yet known)
 <= data "cloudinit_config" "agent_user_data"  {
      + id       = (known after apply)
      + rendered = (known after apply)

      + part {
          + content      = (known after apply)
          + content_type = "text/x-shellscript"
        }
    }

  # module.k3s.data.cloudinit_config.userData will be read during apply
  # (config refers to values not yet known)
 <= data "cloudinit_config" "userData"  {
      + id       = (known after apply)
      + rendered = (known after apply)

      + part {
          + content      = <<-EOT
                #cloud-config
                ---
                hostname: "awsk3s01"
            EOT
          + content_type = "text/cloud-config"
        }
      + part {
          + content      = (known after apply)
          + content_type = "text/x-shellscript"
        }
      + part {
          + content_type = "text/x-shellscript"
        }
      + part {
          + content      = <<-EOT
                #!/bin/bash
                apt-get update && \
                apt-get install ec2-instance-connect -y
            EOT
          + content_type = "text/x-shellscript"
        }
    }

  # module.k3s.aws_autoscaling_group.agent_autoscaling_group will be created
  + resource "aws_autoscaling_group" "agent_autoscaling_group" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 0
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + max_size                  = 0
      + metrics_granularity       = "1Minute"
      + min_size                  = 0
      + name                      = "awsk3s01-agent"
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }
    }

  # module.k3s.aws_instance.k3s_instance will be created
  + resource "aws_instance" "k3s_instance" {
      + ami                                  = "ami-0c455f19afe3e6f60"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t4.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "awsk3s01"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.k3s.aws_key_pair.k3s_keypair will be created
  + resource "aws_key_pair" "k3s_keypair" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "awsk3s01"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + tags_all        = (known after apply)
    }

  # module.k3s.aws_launch_template.agent_launch_template will be created
  + resource "aws_launch_template" "agent_launch_template" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "*********************"
      + instance_type          = "t4.small"
      + key_name               = "awsk3s01"
      + latest_version         = (known after apply)
      + name                   = "awsk3s01-agent"
      + name_prefix            = (known after apply)
      + tags_all               = (known after apply)
      + user_data              = (known after apply)
      + vpc_security_group_ids = (known after apply)

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }
    }

  # module.k3s.random_string.agent_token will be created
  + resource "random_string" "agent_token" {
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Warning: Provider aws is undefined

  on main.tf line 97, in module "k3s":
  97:     aws = aws

Module module.k3s does not declare a provider named aws.
If you wish to specify a provider configuration for the module, add an entry
for aws in the required_providers block within the module.
```
</details>

:x: Error applying plan in [AWSK3S01 Trunk Apply #1](https://github.com/yardbirdsax/infra-k8slab/actions/runs/1487612744)